Revit 2024 API
NestedFamilyTypeReference.CategoryId Property
 Category Id of the referenced family
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public ElementId CategoryId { get; }
Visual Basic
Public ReadOnly Property CategoryId As ElementId
	Get
Visual C++
public:
property ElementId^ CategoryId {
	ElementId^ get ();
}
See Also
NestedFamilyTypeReference Class
Autodesk.Revit.DB Namespace